converted text bases ASCII images to enrich media images
